TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_timer.h
    return ((DL_TIMER_CAC)(advCtl));
}

/**
 *  @brief     Get timer counter load control operation
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return @ref DL_TIMER_CLC
 */
__STATIC_INLINE DL_TIMER_CLC DL_Timer_getCounterLoadControl(
    GPTIMER_Regs *gptimer)
{
    uint32_t loadCtl = gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_CLC_MASK;

    return ((DL_TIMER_CLC)(loadCtl));
}

/**
 *  @brief     Configure timer counter couting mode
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  countMode       Specifies timer counter couting mode.
 *                              @ref DL_TIMER_COUNT_MODE
 */
__STATIC_INLINE void DL_Timer_setCounterMode(
    GPTIMER_Regs *gptimer, DL_TIMER_COUNT_MODE countMode)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL, ((uint32_t) countMode),
        (GPTIMER_CTRCTL_CM_MASK));
}

/**
 *  @brief     Get timer counter couting mode
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 *  @return @ref DL_TIMER_COUNT_MODE
 */
__STATIC_INLINE DL_TIMER_COUNT_MODE DL_Timer_getCounterMode(
    GPTIMER_Regs *gptimer)
{
    uint32_t cmMode = (gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_CM_MASK);
    return ((DL_TIMER_COUNT_MODE) cmMode);
}

/**
 *  @brief      Configures counter value after enable
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  cvae         Speficies counter value after enable.
 *                           @ref DL_TIMER_COUNT_AFTER_EN
 *
 */
__STATIC_INLINE void DL_Timer_setCounterValueAfterEnable(
    GPTIMER_Regs *gptimer, DL_TIMER_COUNT_AFTER_EN cvae)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL, (uint32_t) cvae,
        GPTIMER_CTRCTL_CVAE_MASK);
}

/**
 *  @brief      Returns counter value after enable cofiguration
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                           peripheral
 *  @return  @ref DL_TIMER_COUNT_AFTER_EN
 *
 */
__STATIC_INLINE DL_TIMER_COUNT_AFTER_EN DL_Timer_getCounterValueAfterEnable(
    GPTIMER_Regs *gptimer)
{
    uint32_t cvae = gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_CVAE_MASK;

    return ((DL_TIMER_COUNT_AFTER_EN)(cvae));
}

/**
 *  @brief     Configure timer repeat counter mode
 *
 *  @note Refer to device datasheet to determine if timer instance supports
 *  this feature. Only Timer instances which supports repeat counter supports
 *  this feature.
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  repeatMode      Specifies timer repeat counter mode
 *                              @ref DL_TIMER_REPEAT_MODE
 */
__STATIC_INLINE void DL_Timer_setCounterRepeatMode(
    GPTIMER_Regs *gptimer, DL_TIMER_REPEAT_MODE repeatMode)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL, (uint32_t) repeatMode,
        GPTIMER_CTRCTL_REPEAT_MASK);
}

/**
 *  @brief     Get timer repeat counter mode
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return @ref DL_TIMER_REPEAT_MODE
 */
__STATIC_INLINE DL_TIMER_REPEAT_MODE DL_Timer_getCounterRepeatMode(
    GPTIMER_Regs *gptimer)
{
    uint32_t repeatMode =
        gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_REPEAT_MASK;

    return ((DL_TIMER_REPEAT_MODE)(repeatMode));
}

/**
 *  @brief      Configure timer in one shot or periodic timer mode
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Timer mode. Any other custom configuration can be done after calling
 *  this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_TimerConfig.
 *
 */
void DL_Timer_initTimerMode(
    GPTIMER_Regs *gptimer, DL_Timer_TimerConfig *config);

/**
 *  @brief      Configure timer in edge count, period capture, edge time or
 *              pulse-width capture mode
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Capture mode. Any other custom configuration can be done after
 *  calling this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_CaptureConfig.
 *
 */
void DL_Timer_initCaptureMode(
    GPTIMER_Regs *gptimer, DL_Timer_CaptureConfig *config);

/**
 *  @brief      Configure timer in edge count, period capture, edge time or
 *              pulse-width capture mode using the trigger as input source
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Capture mode. Any other custom configuration can be done after
 *  calling this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_CaptureTriggerConfig.
 *
 */
void DL_Timer_initCaptureTriggerMode(
    GPTIMER_Regs *gptimer, DL_Timer_CaptureTriggerConfig *config);

/**
 *  @brief      Configure timer in combined pulse-width and period capture
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Capture mode. Any other custom configuration can be done after
 *  calling this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_CaptureCombinedConfig.
 *
 */
void DL_Timer_initCaptureCombinedMode(
    GPTIMER_Regs *gptimer, DL_Timer_CaptureCombinedConfig *config);

/**
 *  @brief      Configure timer in edge count compare mode
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Compare mode. Any other custom configuration can be done after
 *  calling this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_CompareConfig.
 *
 */
void DL_Timer_initCompareMode(
    GPTIMER_Regs *gptimer, DL_Timer_CompareConfig *config);

/**
 *  @brief      Configure timer in edge count compare mode using the trigger as
 *              input source
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in Compare mode. Any other custom configuration can be done after
 *  calling this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the mode configuration struct
 *                             @ref DL_Timer_CompareTriggerConfig.
 *
 */
void DL_Timer_initCompareTriggerMode(
    GPTIMER_Regs *gptimer, DL_Timer_CompareTriggerConfig *config);

/**
 * @brief Configure timer in Pulse Width Modulation Mode
 *  Initializes all the common configurable options for the TIMx peripheral when
 *  used in PWM mode. Any other custom configuration can be done after calling
 *  this API. Configures the top two CC blocks and then configures the bottom
 *  two CC blocks.
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 * @param config               Pointer to the mode configuration struct
 *                             @ref DL_Timer_PWMConfig.
 */
void DL_Timer_initFourCCPWMMode(
    GPTIMER_Regs *gptimer, DL_Timer_PWMConfig *config);

/*!
 * @brief Redirects to common @ref DL_Timer_initFourCCPWMMode
 */
#define DL_Timer_initPWMMode DL_Timer_initFourCCPWMMode

/**
 *  @brief      Reset register controlling counter operation
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_resetCounterMode(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL = GPTIMER_CTRCTL_EN_DISABLED;
}

/**
 *  @brief      Sets Timer Capture Compare Value
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  value          Value to write to capture compare register
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareValue(
    GPTIMER_Regs *gptimer, uint32_t value, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief      Get Timer Capture Compare value
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral

 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return     The current capture compare value
 *
 *
 */
uint32_t DL_Timer_getCaptureCompareValue(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Sets Capture Compare Control configuration
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccMode         Specifies whether the CC register is used as a
 *                             capture register or a compare register
 *                             @ref DL_TIMER_CC_MODE
 *  @param[in]  ccCondMask     Specifies zero, load, advance and capture
 *                             conditions. Bitwise OR of @ref DL_TIMER_CC_ZCOND,
 *                             @ref DL_TIMER_CC_LCOND, @ref DL_TIMER_CC_ACOND,
 *                             @ref DL_TIMER_CC_CCOND
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareCtl(GPTIMER_Regs *gptimer, uint32_t ccMode,
    uint32_t ccCondMask, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief   Gets Capture Compare Control configuration
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return Bitwise OR of @ref DL_TIMER_CC_MODE, @ref DL_TIMER_CC_ZCOND,
 *          @ref DL_TIMER_CC_LCOND, @ref DL_TIMER_CC_ACOND,
 *          @ref DL_TIMER_CC_CCOND
 *
 */
uint32_t DL_Timer_getCaptureCompareCtl(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Configures source for second capture compare down event
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in] secCompDn     Specifies second capture compare down event
 *                           source. @ref DL_TIMER_SEC_COMP_DOWN_EVT
 *  @param[in] ccIndex       Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setSecondCompSrcDn(GPTIMER_Regs *gptimer,
    DL_TIMER_SEC_COMP_DOWN_EVT secCompDn, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Gets source for second capture compare down event
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  ccIndex      Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 *  @return @ref DL_TIMER_SEC_COMP_DOWN_EVT
 */
DL_TIMER_SEC_COMP_DOWN_EVT DL_Timer_getSecondCompSrcDn(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Configures source for second capture compare up event
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in] secCompUp     Specifies second capture compare up event
 *                           source. @ref DL_TIMER_SEC_COMP_UP_EVT
 *  @param[in] ccIndex       Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setSecondCompSrcUp(GPTIMER_Regs *gptimer,
    DL_TIMER_SEC_COMP_UP_EVT secCompUp, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Gets source for second capture compare down event
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  ccIndex      Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 *  @return @ref DL_TIMER_SEC_COMP_UP_EVT
 */
DL_TIMER_SEC_COMP_UP_EVT DL_Timer_getSecondCompSrcUp(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Enables suppression of compare event if repeat counter is not equal to
 *         zero
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  ccIndex      Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 */
void DL_Timer_enableSuppressionOfCompEvent(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Disables suppression of compare event if repeat counter is not equal
 *         to zero
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  ccIndex      Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 */
void DL_Timer_disableSuppressionOfCompEvent(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Configures capture compare shadow register update method
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in] ccUpdtMode    Specifies capture compare shadow register update
 *                           method. @ref DL_TIMER_CC_UPDATE_METHOD
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptCompUpdateMethod(GPTIMER_Regs *gptimer,
    DL_TIMER_CC_UPDATE_METHOD ccUpdtMode, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Gets capture compare shadow register update method
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  ccIndex      Index associated to capture compare register
 *                           @ref DL_TIMER_CC_INDEX.
 * @return @ref DL_TIMER_CC_UPDATE_METHOD
 */
DL_TIMER_CC_UPDATE_METHOD DL_Timer_getCaptCompUpdateMethod(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief     Sets Capture Compare Output Control
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccpIV          Specifies the logical value put on the CCP
 *                             output while the output is disabled
 *                             @ref DL_TIMER_CC_OCTL_INIT_VAL
 *  @param[in]  ccpOInv        Specifies if the he output as selected by ccpo is
 *                             inverted. @ref DL_TIMER_CC_OCTL_INV_OUT
 *  @param[in]  ccpO           CCP Output Source @ref DL_TIMER_CC_OCTL_SRC
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareOutCtl(GPTIMER_Regs *gptimer, uint32_t ccpIV,
    uint32_t ccpOInv, uint32_t ccpO, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Gets Capture Compare Output Control
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return Bitwise OR of @ref DL_TIMER_CC_OCTL_INIT_VAL,
 *          @ref DL_TIMER_CC_OCTL_INV_OUT, @ref DL_TIMER_CC_OCTL_SRC
 *
 */
uint32_t DL_Timer_getCaptureCompareOutCtl(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief     Sets actions of the signal generator
 *
 *  @param[in] gptimer       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in] actionsMask   Bit mask of signal generator actions. Bitwise OR of
 *                           @ref DL_TIMER_CC_SWFRCACT_CMPL, @ref DL_TIMER_CC_SWFRCACT,
 *                           @ref DL_TIMER_CC_CC2UACT, @ref DL_TIMER_CC_CC2DACT,
 *                           @ref DL_TIMER_CC_FEXACT, @ref DL_TIMER_CC_FENACT,
 *                           @ref DL_TIMER_CC_CUACT, @ref DL_TIMER_CC_CDACT,
 *                           @ref DL_TIMER_CC_LACT, @ref DL_TIMER_CC_ZACT,
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareAction(
    GPTIMER_Regs *gptimer, uint32_t actionsMask, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Gets actions of the signal generator
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return Bitwise OR of @ref DL_TIMER_CC_SWFRCACT_CMPL, @ref DL_TIMER_CC_SWFRCACT,
 *          @ref DL_TIMER_CC_CC2UACT, @ref DL_TIMER_CC_CC2DACT,
 *          @ref DL_TIMER_CC_FEXACT, @ref DL_TIMER_CC_FENACT,
 *          @ref DL_TIMER_CC_CUACT, @ref DL_TIMER_CC_CDACT,
 *          @ref DL_TIMER_CC_LACT, @ref DL_TIMER_CC_ZACT.
 *
 */
uint32_t DL_Timer_getCaptureCompareAction(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Set second comparator down counting timer channel output action
 *
 *  The timer channel output will be set to selected
 *  @ref DL_TIMER_SEC_COMP_DOWN_ACT_SEL when the timer counter reaches the
 *  configured capture compare value configure by
 *  @sa DL_Timer_setSecondCompSrcDn
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  secCompDnAct   One of @ref DL_TIMER_SEC_COMP_DOWN_ACT_SEL.
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setSecondCompActionDn(GPTIMER_Regs *gptimer,
    DL_TIMER_SEC_COMP_DOWN_ACT_SEL secCompDnAct, DL_TIMER_CC_INDEX ccIndex);
/**
 *  @brief    Gets second comparator down counting timer channel output action
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return @ref DL_TIMER_SEC_COMP_DOWN_ACT_SEL
 *
 */
DL_TIMER_SEC_COMP_DOWN_ACT_SEL DL_Timer_getSecondCompActionDn(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Sets second comparator up counting timer channel output action
 *
 *  The timer channel output will be set to selected
 *  @ref DL_TIMER_SEC_COMP_UP_ACT_SEL when the timer counter reaches the
 *  configured capture compare value configure by
 *  @sa DL_Timer_setSecondCompSrcUp
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  secCompUpAct   One of @ref DL_TIMER_SEC_COMP_UP_ACT_SEL.
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setSecondCompActionUp(GPTIMER_Regs *gptimer,
    DL_TIMER_SEC_COMP_UP_ACT_SEL secCompUpAct, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Gets second comparator up counting timer channel output action
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return @ref DL_TIMER_SEC_COMP_UP_ACT_SEL
 *
 */
DL_TIMER_SEC_COMP_UP_ACT_SEL DL_Timer_getSecondCompActionUp(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Overrides the timer CCP output
 *
 *  @param[in]  gptimer       Pointer to the register overlay for the
 *                            peripheral
 *  @param[in]  out           Specifies the CCP output state.
 *                            @ref DL_TIMER_FORCE_OUT
 *  @param[in]  outComp       If timer insatance supports complementary output,
 *                            it allows to override complementary out also.
 *                            If timer instance doesn't support complementary
 *                            output, this parameter is ignored.
 *                            @ref DL_TIMER_FORCE_CMPL_OUT
 *  @param[in]  ccIndex       Index associated to capture compare register
 *                            @ref DL_TIMER_CC_INDEX.
 */
void DL_Timer_overrideCCPOut(GPTIMER_Regs *gptimer, DL_TIMER_FORCE_OUT out,
    DL_TIMER_FORCE_CMPL_OUT outComp, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief     Sets Capture Compare Input
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  inv            Specifies whether the selected input is
 *                             inverted. @ref DL_TIMER_CC_INPUT_INV
 *  @param[in]  isel           Selects the input source to the filter
 *                             input. @ref DL_TIMER_CC_IN_SEL
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareInput(GPTIMER_Regs *gptimer, uint32_t inv,
    uint32_t isel, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Gets Capture Compare Input
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return Bitwise OR of @ref DL_TIMER_CC_INPUT_FILT_CPV,
 *          @ref DL_TIMER_CC_INPUT_FILT_FP
 *
 */
uint32_t DL_Timer_getCaptureCompareInput(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief     Sets Capture Compare Input Filter
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  cpv            Specifies fitering mode.
 *                             @ref DL_TIMER_CC_INPUT_FILT_CPV
 *  @param[in]  fp             Specifies the filter period.
 *                             @ref DL_TIMER_CC_INPUT_FILT_FP
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 */
void DL_Timer_setCaptureCompareInputFilter(GPTIMER_Regs *gptimer, uint32_t cpv,
    uint32_t fp, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief    Gets Capture Compare Input Filter
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *
 *  @return Bitwise OR of @ref DL_TIMER_CC_INPUT_FILT_CPV,
 *          @ref DL_TIMER_CC_INPUT_FILT_FP
 *
 */
uint32_t DL_Timer_getCaptureCompareInputFilter(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

